dist/EventSamples/ALERT.KESI.IssueUpdate/1.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<s:Header></s:Header>
	<s:Body>
		<wsnt:Notify>
			<wsnt:NotificationMessage>
				<wsnt:Topic></wsnt:Topic>
				<wsnt:ProducerReference>
					<wsa:Address>http://www.alert-project.eu/kesi</wsa:Address>
				</wsnt:ProducerReference>
				<wsnt:Message>
					<ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki"    xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
						<ns1:head>
							<ns1:sender>KESI</ns1:sender>
							<ns1:timestamp>10000</ns1:timestamp>
							<ns1:sequencenumber>1</ns1:sequencenumber>
						</ns1:head>
						<ns1:payload>
							<ns1:meta>
								<ns1:startTime>10010</ns1:startTime>
								<ns1:endTime>10010</ns1:endTime>
								<ns1:eventName>ALERT.KESI.IssueUpdate</ns1:eventName>
								<ns1:eventType>request</ns1:eventType>
							</ns1:meta>
							<ns1:eventData>
								<s:issue>
									<s:issueStatus>Resolved</s:issueStatus>
									<s:issueResolution>WorksForMe</s:issueResolution>
									<s:issueDependsOnId>10003</s:issueDependsOnId>
									<s:issueLastModified>2011-11-08 14:04</s:issueLastModified>
									<s:issueComment>
										<s:commentId></s:commentId>
										<!-- if comment number already exist, comment will be updated, if not, it will be added -->
										<s:commentNumber>1</s:commentNumber>
										<s:commentText>Old comment text</s:commentText>
										<s:commentPerson>
											<s:name>Sasa Stojanovic</s:name>
											<s:id>sasa.stojanovic@cimcollege.rs</s:id>
											<s:email>sasa.stojanovic@cimcollege.rs</s:email>
										</s:commentPerson>
										<s:commentDate>2011-11-08 14:04</s:commentDate>
									</s:issueComment>
									<s:issueActivity>
										<s:activityId></s:activityId>
										<s:activityWho>sasa.stojanovic@cimcollege.rs</s:activityWho>
										<s:activityWhen>2011-11-08 14:04</s:activityWhen>
										<s:activityWhat>Status</s:activityWhat>
										<s:activityRemoved>Assigned</s:activityRemoved>
										<s:activityAdded>Resolved</s:activityAdded>
									</s:issueActivity>	
								</s:issue>
							</ns1:eventData>
						</ns1:payload>
					</ns1:event>
				</wsnt:Message>
			</wsnt:NotificationMessage>
		</wsnt:Notify>
	</s:Body>
</s:Envelope>